#coding=utf-8

words = ['中国香港', '出现', '了', '新一波', '的', '疫情', '单日', '新增', '病例', '波动', '于', '20', '40', '余例', '之间', '新疆', '乌鲁木齐市', '近日', '也', '出现', '新增', '确诊', '病例', '和', '无症状', '感染者', '引起', '了', '大家', '的', '关注', '事实上', '中国', '局部地区', '出现', '小规模', '聚集', '性', '病例', '是', '疫情', '防控', '常态', '化', '的', '特点', '之一', '之前', '的', '北京', '也', '是', '如此', '同时', '我们', '可以', '看到', '在', '疫情', '发生', '后', '北京', '和', '乌鲁木齐市', '都', '迅速', '重拳出击', '开展', '了', '大排查', '结合', '流行病学', '调研', '和', '全面', '排摸', '快速', '开展', '了', '精准', '的', '应检尽检', '这样', '一种', '主动', '快速', '精准', '的', '防控', '其', '背后', '是', '我国', '政府', '零', '遗漏', '持续', '接近', '零', '病例', '的', '决心', '不同于', '北京', '和', '乌鲁木齐市', '香港', '早前', '采取', '的', '策略', '是', '应症', '就诊', '并', '没有', '像', '北京', '一样', '再', '出现', '第一例', '病例', '后', '迅速', '扩大', '检测', '开展', '大排查', '和', '普筛', '这', '背后', '是', '基于', '香港', '将', '病情', '控制', '在', '低水平', '而', '非', '清零', '的', '理念', '这样', '的', '措施', '虽然', '对于', '短期', '医疗', '资源', '的', '耗费', '是', '相对', '少', '的', '但是', '由此', '带来', '的', '疫情', '长期', '波动', '导致', '的', '社会', '经济', '成本', '可能', '会', '更', '高']

freq ={}

for w in words:
    freq[w] = freq.get(w,0.0) + 1.0

total = sum(freq.values())

print(total)
# 对字典进行排序
# s = sorted(freq.items(),key=lambda x:x[1],reverse=True)
# print(s)

